This notebook contains Basic functionality of pandas as a library.

In [1]:
import pandas as pd

In [3]:
chip = pd.read_table(r'C:\Users\HP\Desktop\Pandas_data\Chipotle.txt',sep = "\t")
chip.head()

,order_id,quantity,item_name,choice_description,item_price
0,1,1,Chips and Fresh Tomato Salsa,NaN,$2.39
1,1,1,Izze,[Clementine],$3.39
2,1,1,Nantucket Nectar,[Apple],$3.39
3,1,1,Chips and Tomatillo-Green Chili Salsa,NaN,$2.39
4,2,2,Chicken Bowl,"[Tomatillo-Red Chili Salsa (Hot), [Black Beans...",$16.98

In [4]:
user_cols =['user_id','age','gender','occupation','zipcode']
movie = pd.read_table(r'C:\Users\HP\Desktop\Pandas_data\movieusers.txt',sep="|",header = None,names=user_cols)
movie

     user_id  age gender     occupation zipcode
0          1   24      M     technician   85711
1          2   53      F          other   94043
2          3   23      M         writer   32067
3          4   24      M     technician   43537
4          5   33      F          other   15213
..       ...  ...    ...            ...     ...
938      939   26      F        student   33319
939      940   32      M  administrator   02215
940      941   20      M        student   97229
941      942   48      F      librarian   78209
942      943   22      M        student   77841

[943 rows x 5 columns]

## How do I select a pandas Series from a DataFrame?

In [2]:
ufo = pd.read_table(r'C:\Users\HP\Desktop\Pandas_data\uforeports.txt',sep=",")
ufo

,City,Colors Reported,Shape Reported,State,Time
0,Ithaca,NaN,TRIANGLE,NY,6/1/1930 22:00
1,Willingboro,NaN,OTHER,NJ,6/30/1930 20:00
2,Holyoke,NaN,OVAL,CO,2/15/1931 14:00
3,Abilene,NaN,DISK,KS,6/1/1931 13:00
4,New York Worlds Fair,NaN,LIGHT,NY,4/18/1933 19:00
...,...,...,...,...,...
18236,Grant Park,NaN,TRIANGLE,IL,12/31/2000 23:00
18237,Spirit Lake,NaN,DISK,IA,12/31/2000 23:00
18238,Eagle River,NaN,NaN,WI,12/31/2000 23:45
18239,Eagle River,RED,LIGHT,WI,12/31/2000 23:45
18240,Ybor,NaN,OVAL,FL,12/31/2000 23:59

In [ ]:
type(ufo['City'])
type(ufo)

In [ ]:
ufo.City
ufo['location'] = ufo.City + ' ,'+ ufo.State

In [ ]:
dir(ufo)
ufo

## Why do some pandas commands end with parentheses (and others don't)?

In [ ]:
movies = pd.read_csv(r'C:\Users\HP\Desktop\Pandas_data\imdbratings.txt')
movies

In [ ]:
movies.head()

In [ ]:
movies.describe(include = 'all')

In [ ]:
movie.shape

In [ ]:
movie.dtypes

In [ ]:
#movie.(Press Tab here to generate the drop-down for the attributes)
#movie.() Contains the method

In [ ]:
movie.describe()
#Press Shift+Tab and see the options and parameters required to use this

## How do I rename columns in a pandas DataFrame?

In [ ]:
ufo.columns

In [ ]:
#Method_1
ufo.rename(columns = {'Colors Reported':'Colors_Reported','Shape Reported':'Shape_Reported'},inplace =True)

In [ ]:
#Method_2
ufo_cols = ['City', 'Colors Reported', 'Shape Reported', 'State', 'Time','location']
ufo.columns = ufo_cols
ufo.head()

In [ ]:
#Method_3
#It could be done while reading the data as well
ufo = pd.read_table(r'C:\Users\HP\Desktop\Pandas_data\uforeports.txt',sep=",",names=ufo_cols,header =0)
ufo

In [ ]:
#method_4 : Probably the nest one because it could be used for a data set with huge number of columns
ufo.columns = ufo.columns.str.replace(' ','_')
ufo

## How do I remove columns from a pandas DataFrame?

In [ ]:
ufo.head()
ufo.shape
ufo.columns

In [ ]:
#Method1
ufo.drop('Colors Reported',axis=1,inplace=True)

In [ ]:
ufo.head()

In [ ]:
ufo.drop([0,1],axis=0,inplace=True)
#Bascically removed the index number we saw on the left side

In [ ]:
ufo.head()

## How do I sort a pandas DataFrame or a Series?

In [ ]:
movies.head()

In [ ]:
movies['title'].sort_values(ascending=False)
#The Datatype for the output is series, the goal is to sort the dataframe by a series

In [ ]:
movies.sort_values('title',ascending =False)

In [ ]:
movies.sort_values(['title','duration'],ascending =False)

## How do I filter rows of a pandas DataFrame by column value?

In [ ]:
#How does row filter work:
booleans =[]
for length in movies.duration:
    if length >= 200:
        booleans.append(True)
    else:
        booleans.append(False)  
#Basically the above function gives us a list of booleans whose size is same as the one overall data set

In [ ]:
booleans
#converting a list to pandas series
is_long = pd.Series(booleans)
is_long
movies[is_long]
#That's how the filter row works

In [ ]:
#method2
is_long = movies.duration >=200
is_long

In [ ]:
#method3 & the easiest
movies[movies.duration >=200]
movies[movies['duration']>=200]
#It could be done either ways

In [ ]:
#.loc is very powerfull to use 
movies.loc[movies['duration']>=200,'genre']

## How do I apply multiple filter criteria to a pandas DataFrame?

In [ ]:
movies[(movies.duration >=200) & (movies.genre =='Drama')]

In [ ]:
movies[movies.genre.isin(['Drama','Crime','Action'])]

## How do I use the "axis" parameter in pandas?

In [11]:
drinks = pd.read_csv(r'C:\Users\HP\Desktop\Pandas_data\drinksbycountry.txt')
drinks

,country,beer_servings,spirit_servings,wine_servings,total_litres_of_pure_alcohol,continent
0,Afghanistan,0,0,0,0.0,Asia
1,Albania,89,132,54,4.9,Europe
2,Algeria,25,0,14,0.7,Africa
3,Andorra,245,138,312,12.4,Europe
4,Angola,217,57,45,5.9,Africa
...,...,...,...,...,...,...
188,Venezuela,333,100,3,7.7,South America
189,Vietnam,111,2,1,2.0,Asia
190,Yemen,6,0,0,0.1,Asia
191,Zambia,32,19,4,2.5,Africa
192,Zimbabwe,64,18,4,4.7,Africa

In [ ]:
drinks.drop('continent',axis=1).head()
drinks.drop(2,axis=0).head()

In [ ]:
#mean of each Column
drinks.mean(axis=0) 
#mean of each Row
drinks.mean(axis=1)

## How do I use string methods in pandas?

In [ ]:
chip.head()

In [ ]:
chip.item_name.str.upper()

In [ ]:
chip[chip.item_name.str.contains('Chicken')]

In [ ]:
chip.choice_description.str.replace('[',' ').str.replace(']',' ')

## How do I change the data type of a pandas Series?

In [ ]:
drinks

In [ ]:
drinks.dtypes

In [ ]:
drinks['beer_servings'] = drinks.beer_servings.astype(float)
drinks.dtypes

In [ ]:
drinks = pd.read_csv(r'C:\Users\HP\Desktop\Pandas_data\drinksbycountry.txt',dtype = {'beer_servings':float})
drinks
#While reading the dataframe

In [ ]:
chip.head()

In [ ]:
#Check the item price column. The issue here is that it contains '$' and is taken as a string data type
chip.dtypes

In [ ]:
#The goal is to have do mathematic computatiion on the item_price column
chip.item_price.str.replace('$','').astype(float).mean()

## When should I use a "groupby" in pandas?

In [ ]:
drinks.head()

In [ ]:
drinks.groupby('continent').beer_servings.mean()

In [ ]:
drinks.groupby('continent').beer_servings.agg(['mean','max','count','sum']).sort_values('mean',ascending = False)

In [ ]:
%matplotlib inline

In [ ]:
drinks.groupby('continent').mean().plot(kind='bar')

## How do I explore a pandas Series?

In [ ]:
movies.head()

In [ ]:
movies.genre.describe()
#count is non-null values
#top is the most frequent value
#freq is the number of times the top value is repeated

In [ ]:
#Another function called value_count allows counts for each genre
movies.genre.value_counts()

In [ ]:
#Cool feature is to get percentage
movies.genre.value_counts(normalize =True)

In [ ]:
#get a list of unique values in the series
movies.genre.unique()

In [ ]:
#Get the number of unique Values in the series
movies.genre.nunique()

In [ ]:
#This function would give us a crosstab of 2 columns and how their counts are distributed
pd.crosstab(movies.genre,movies.content_rating)

In [ ]:
movies.duration.describe()

In [ ]:
%matplotlib inline

In [ ]:
movies.duration.plot(kind='hist')

In [ ]:
movies.genre.value_counts().plot(kind='bar')

## How do I handle missing values in pandas?

In [6]:
ufo.tail()

              City Colors Reported Shape Reported State              Time
18236   Grant Park             NaN       TRIANGLE    IL  12/31/2000 23:00
18237  Spirit Lake             NaN           DISK    IA  12/31/2000 23:00
18238  Eagle River             NaN            NaN    WI  12/31/2000 23:45
18239  Eagle River             RED          LIGHT    WI  12/31/2000 23:45
18240         Ybor             NaN           OVAL    FL  12/31/2000 23:59

In [7]:
ufo.isnull()

        City  Colors Reported  Shape Reported  State   Time
0      False             True           False  False  False
1      False             True           False  False  False
2      False             True           False  False  False
3      False             True           False  False  False
4      False             True           False  False  False
...      ...              ...             ...    ...    ...
18236  False             True           False  False  False
18237  False             True           False  False  False
18238  False             True            True  False  False
18239  False            False           False  False  False
18240  False             True           False  False  False

[18241 rows x 5 columns]

In [8]:
ufo.notnull()

       City  Colors Reported  Shape Reported  State  Time
0      True            False            True   True  True
1      True            False            True   True  True
2      True            False            True   True  True
3      True            False            True   True  True
4      True            False            True   True  True
...     ...              ...             ...    ...   ...
18236  True            False            True   True  True
18237  True            False            True   True  True
18238  True            False           False   True  True
18239  True             True            True   True  True
18240  True            False            True   True  True

[18241 rows x 5 columns]

In [9]:
ufo.isnull().sum()

City                  25
Colors Reported    15359
Shape Reported      2644
State                  0
Time                   0
dtype: int64

In [11]:
ufo[ufo.City.isnull()]

      City Colors Reported Shape Reported State              Time
21     NaN             NaN            NaN    LA    8/15/1943 0:00
22     NaN             NaN          LIGHT    LA    8/15/1943 0:00
204    NaN             NaN           DISK    CA   7/15/1952 12:30
241    NaN            BLUE           DISK    MT    7/4/1953 14:00
613    NaN             NaN           DISK    NV    7/1/1960 12:00
1877   NaN          YELLOW         CIRCLE    AZ    8/15/1969 1:00
2013   NaN             NaN            NaN    NH     8/1/1970 9:30
2546   NaN             NaN       FIREBALL    OH  10/25/1973 23:30
3123   NaN             RED       TRIANGLE    WV  11/25/1975 23:00
4736   NaN             NaN         SPHERE    CA   6/23/1982 23:00
5269   NaN             NaN            NaN    AZ   6/30/1985 21:30
6735   NaN             NaN      FORMATION    TX     4/1/1992 2:00
7208   NaN             NaN         CIRCLE    MI   10/4/1993 17:30
8828   NaN             NaN       TRIANGLE    WA  10/30/1995 21:30
8967   NaN             NaN        VARIOUS    CA   12/8/1995 18:00
9273   NaN             NaN       TRIANGLE    OH     5/1/1996 3:00
9388   NaN             NaN           OVAL    CA   6/12/1996 12:00
9587   NaN             NaN            EGG    FL   8/24/1996 15:00
10399  NaN             NaN       TRIANGLE    IL   6/15/1997 23:00
11625  NaN             NaN         CIRCLE    TX     6/7/1998 7:00
12441  NaN             RED       FIREBALL    WA  10/26/1998 17:58
15767  NaN             NaN      RECTANGLE    NV   1/21/2000 11:30
15812  NaN             NaN          LIGHT    NV     2/2/2000 3:00
16054  NaN           GREEN            NaN    FL    3/11/2000 3:30
16608  NaN             NaN         SPHERE    NY   6/15/2000 15:00

In [13]:
ufo.shape

(18241, 5)

In [14]:
ufo.dropna(how='any').shape
#how='any' drops the row if any of the 5 values has missing values

(2486, 5)

In [15]:
ufo.dropna(how='all').shape

(18241, 5)

In [16]:
ufo.dropna(subset = ['City','Shape Reported'],how='any').shape

(15576, 5)

In [21]:
ufo['Shape Reported'].value_counts()
#value_count does not include Nulls
ufo['Shape Reported'].value_counts(dropna=False)
#parameter dropna is considered to be true but addition of it in the fucntion leads to presence of Nan(Not as Number)

LIGHT        2803
NaN          2644
DISK         2122
TRIANGLE     1889
OTHER        1402
CIRCLE       1365
SPHERE       1054
FIREBALL     1039
OVAL          845
CIGAR         617
FORMATION     434
VARIOUS       333
RECTANGLE     303
CYLINDER      294
CHEVRON       248
DIAMOND       234
EGG           197
FLASH         188
TEARDROP      119
CONE           60
CROSS          36
DELTA           7
ROUND           2
CRESCENT        2
DOME            1
PYRAMID         1
FLARE           1
HEXAGON         1
Name: Shape Reported, dtype: int64

In [23]:
#The goal here is to populate the Nan values with a value in place which is 'Other' in this case
ufo['Shape Reported'].fillna(value='OTHER',inplace=True)
ufo['Shape Reported'].value_counts(dropna=False)

OTHER        4046
LIGHT        2803
DISK         2122
TRIANGLE     1889
CIRCLE       1365
SPHERE       1054
FIREBALL     1039
OVAL          845
CIGAR         617
FORMATION     434
VARIOUS       333
RECTANGLE     303
CYLINDER      294
CHEVRON       248
DIAMOND       234
EGG           197
FLASH         188
TEARDROP      119
CONE           60
CROSS          36
DELTA           7
ROUND           2
CRESCENT        2
DOME            1
PYRAMID         1
FLARE           1
HEXAGON         1
Name: Shape Reported, dtype: int64

## What do I need to know about the pandas index?

In [25]:
drinks.head()

,country,beer_servings,spirit_servings,wine_servings,total_litres_of_pure_alcohol,continent
0,Afghanistan,0,0,0,0.0,Asia
1,Albania,89,132,54,4.9,Europe
2,Algeria,25,0,14,0.7,Africa
3,Andorra,245,138,312,12.4,Europe
4,Angola,217,57,45,5.9,Africa

In [29]:
drinks.index
drinks.columns

Index(['country', 'beer_servings', 'spirit_servings', 'wine_servings',
       'total_litres_of_pure_alcohol', 'continent'],
      dtype='object')

In [30]:
drinks.loc[23,'beer_servings']

245

In [31]:
drinks.set_index('country',inplace=True)
drinks.head()

,beer_servings,spirit_servings,wine_servings,total_litres_of_pure_alcohol,continent
country,,,,,
Afghanistan,0,0,0,0.0,Asia
Albania,89,132,54,4.9,Europe
Algeria,25,0,14,0.7,Africa
Andorra,245,138,312,12.4,Europe
Angola,217,57,45,5.9,Africa

In [33]:
drinks.index
drinks.loc['Brazil','beer_servings']

245

In [34]:
drinks.index.name =None
drinks.head()

,beer_servings,spirit_servings,wine_servings,total_litres_of_pure_alcohol,continent
Afghanistan,0,0,0,0.0,Asia
Albania,89,132,54,4.9,Europe
Algeria,25,0,14,0.7,Africa
Andorra,245,138,312,12.4,Europe
Angola,217,57,45,5.9,Africa

In [35]:
drinks.index.name = 'country'
drinks.reset_index(inplace=True)
drinks.head()

,country,beer_servings,spirit_servings,wine_servings,total_litres_of_pure_alcohol,continent
0,Afghanistan,0,0,0,0.0,Asia
1,Albania,89,132,54,4.9,Europe
2,Algeria,25,0,14,0.7,Africa
3,Andorra,245,138,312,12.4,Europe
4,Angola,217,57,45,5.9,Africa

In [38]:
drinks.describe().loc['25%','beer_servings']
#Could be used to call a specifc cell in a data frame

20.0

## What do I need to know about the pandas index? (Part 2)

In [7]:
drinks.set_index('country',inplace=True)

KeyError: "None of ['country'] are in the columns"

In [11]:
drinks.head()
drinks.continent.head()

country
Afghanistan      Asia
Albania        Europe
Algeria        Africa
Andorra        Europe
Angola         Africa
Name: continent, dtype: object

In [16]:
drinks.continent.value_counts().index
drinks.continent.value_counts().values

array([53, 45, 44, 23, 16, 12], dtype=int64)

In [19]:
drinks.continent.value_counts()['Africa']

53

In [22]:
#Sorted Series
drinks['continent'].value_counts().sort_values()
drinks['continent'].value_counts().sort_index()

Africa           53
Asia             44
Europe           45
North America    23
Oceania          16
South America    12
Name: continent, dtype: int64

In [24]:
#Way to create a series of your own
people = pd.Series([3000000,85000],index=['Albania','Andorra'],name='Population')
people

Albania    3000000
Andorra      85000
Name: Population, dtype: int64

In [27]:
drinks.beer_servings*people

Afghanistan            NaN
Albania        267000000.0
Algeria                NaN
Andorra         20825000.0
Angola                 NaN
                  ...
Venezuela              NaN
Vietnam                NaN
Yemen                  NaN
Zambia                 NaN
Zimbabwe               NaN
Length: 193, dtype: float64

In [28]:
pd.concat([drinks,people],axis=1).head()
#the above cells indicate the use of indexes. It allows to essentially join information on indexes

,beer_servings,spirit_servings,wine_servings,total_litres_of_pure_alcohol,continent,Population
Afghanistan,0,0,0,0.0,Asia,NaN
Albania,89,132,54,4.9,Europe,3000000.0
Algeria,25,0,14,0.7,Africa,NaN
Andorra,245,138,312,12.4,Europe,85000.0
Angola,217,57,45,5.9,Africa,NaN

## How do I select multiple rows and columns from a pandas DataFrame?

In [30]:
ufo.head()

                   City Colors Reported Shape Reported State             Time
0                Ithaca             NaN       TRIANGLE    NY   6/1/1930 22:00
1           Willingboro             NaN          OTHER    NJ  6/30/1930 20:00
2               Holyoke             NaN           OVAL    CO  2/15/1931 14:00
3               Abilene             NaN           DISK    KS   6/1/1931 13:00
4  New York Worlds Fair             NaN          LIGHT    NY  4/18/1933 19:00

In [32]:
ufo.loc[1:3,:]
#Important to remember: loc is inclusive on both sides 1&3

          City Colors Reported Shape Reported State             Time
1  Willingboro             NaN          OTHER    NJ  6/30/1930 20:00
2      Holyoke             NaN           OVAL    CO  2/15/1931 14:00
3      Abilene             NaN           DISK    KS   6/1/1931 13:00

In [40]:
ufo[ufo['City']=='Oakland']
ufo.loc[ufo['City']=='Oakland','State']
#You should know noth the methods but it is more preferable to do the 2nd one with loc

1694     CA
2144     CA
4686     MD
7293     CA
8488     CA
8768     CA
10816    OR
10948    CA
11045    CA
12322    CA
12941    CA
16803    MD
17322    CA
Name: State, dtype: object

In [41]:
#i in iloc stands for integer, therefore the expected input has to be an integer. 
ufo.iloc[:,1:3] 
#Please note that in iloc we only use 1st and 2nd column and not the 3rd one. therefore it is not inclusive

      Colors Reported Shape Reported
0                 NaN       TRIANGLE
1                 NaN          OTHER
2                 NaN           OVAL
3                 NaN           DISK
4                 NaN          LIGHT
...               ...            ...
18236             NaN       TRIANGLE
18237             NaN           DISK
18238             NaN            NaN
18239             RED          LIGHT
18240             NaN           OVAL

[18241 rows x 2 columns]

## When should I use the "inplace" parameter in pandas?

In [7]:
#Inshort the inplace parameter would be usefull in actually making changes to the data set
#The default parameter is set as false so it allows us to experiment
ufo.head()

ufo.drop('City',axis=1, inplace=True).head()

AttributeError: 'NoneType' object has no attribute 'head'

In [10]:
ufo.head()
ufo.fillna(method = 'backfill').head()
#fillna has parameter 'method'

  Colors Reported Shape Reported State             Time
0             RED       TRIANGLE    NY   6/1/1930 22:00
1             RED          OTHER    NJ  6/30/1930 20:00
2             RED           OVAL    CO  2/15/1931 14:00
3             RED           DISK    KS   6/1/1931 13:00
4             RED          LIGHT    NY  4/18/1933 19:00

## How do I make my pandas DataFrame smaller and faster?

In [16]:
drinks.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 193 entries, 0 to 192
Data columns (total 6 columns):
 #   Column                        Non-Null Count  Dtype
---  ------                        --------------  -----
 0   country                       193 non-null    object
 1   beer_servings                 193 non-null    int64
 2   spirit_servings               193 non-null    int64
 3   wine_servings                 193 non-null    int64
 4   total_litres_of_pure_alcohol  193 non-null    float64
 5   continent                     193 non-null    object
dtypes: float64(1), int64(3), object(2)
memory usage: 9.2+ KB

In [15]:
drinks.info(memory_usage='deep')

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 193 entries, 0 to 192
Data columns (total 6 columns):
 #   Column                        Non-Null Count  Dtype
---  ------                        --------------  -----
 0   country                       193 non-null    object
 1   beer_servings                 193 non-null    int64
 2   spirit_servings               193 non-null    int64
 3   wine_servings                 193 non-null    int64
 4   total_litres_of_pure_alcohol  193 non-null    float64
 5   continent                     193 non-null    object
dtypes: float64(1), int64(3), object(2)
memory usage: 30.5 KB

In [17]:
drinks.memory_usage()

Index                            128
country                         1544
beer_servings                   1544
spirit_servings                 1544
wine_servings                   1544
total_litres_of_pure_alcohol    1544
continent                       1544
dtype: int64

In [18]:
drinks.memory_usage(deep=True)

Index                             128
country                         12588
beer_servings                    1544
spirit_servings                  1544
wine_servings                    1544
total_litres_of_pure_alcohol     1544
continent                       12332
dtype: int64

In [19]:
drinks.memory_usage(deep=True).sum()
#adds upto the above memory usage

31224

In [20]:
sorted(drinks.continent.unique())

['Africa', 'Asia', 'Europe', 'North America', 'Oceania', 'South America']

In [21]:
drinks['continent'] = drinks.continent.astype('category')

In [25]:
drinks.dtypes

country                           object
beer_servings                      int64
spirit_servings                    int64
wine_servings                      int64
total_litres_of_pure_alcohol     float64
continent                       category
dtype: object

In [26]:
drinks.continent.head()
#Basically pandas would store the category column as numbers under the head.
#Saves memory and also provides the list of columns

0      Asia
1    Europe
2    Africa
3    Europe
4    Africa
Name: continent, dtype: category
Categories (6, object): ['Africa', 'Asia', 'Europe', 'North America', 'Oceania', 'South America']

In [27]:
#here cat stands for category just like string we use str. For category we use cat . Press tab after the . to get more functions
drinks.continent.cat.codes.head()

0    1
1    2
2    0
3    2
4    0
dtype: int8

In [28]:
drinks.memory_usage(deep=True)
#continent is 756 now earlier it was higher
#not doing the same for country as each country is unique

Index                             128
country                         12588
beer_servings                    1544
spirit_servings                  1544
wine_servings                    1544
total_litres_of_pure_alcohol     1544
continent                         756
dtype: int64

In [29]:
df=pd.DataFrame({'ID':[100,101,102,103],'quality':['good','very good','good','excellent']})

In [30]:
df

    ID    quality
0  100       good
1  101  very good
2  102       good
3  103  excellent

In [38]:
%%timeit
sorted(df)
df.sort_values('quality')

474 Âµs Â± 69.7 Âµs per loop (mean Â± std. dev. of 7 runs, 1,000 loops each)

In [36]:
df['quality'] = df.quality.astype('category',categories=['good','very good','excellent'],ordered =True)
#has been depreceated in the current pandas but it works with a different set of code

TypeError: NDFrame.astype() got an unexpected keyword argument 'categories'

## How do I create dummy variables in pandas?

In [63]:
train = pd.read_csv(r"C:\Users\HP\Downloads\train.csv")
train.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [42]:
#Method1
train['Sex_male'] = train['Sex'].map({'female':0,'male':1})
train.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Sex_male
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S,1
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C,0
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S,0
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S,0
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S,1

In [46]:
#Method2
pd.get_dummies(train['Sex'],prefix='sex_').iloc[:,1:]

     sex__male
0            1
1            0
2            0
3            0
4            1
..         ...
886          1
887          0
888          0
889          1
890          1

[891 rows x 1 columns]

In [48]:
train['Embarked'].value_counts()

S    644
C    168
Q     77
Name: Embarked, dtype: int64

In [52]:
embarked_dummies = pd.get_dummies(train['Embarked'],prefix='Embarked_').iloc[:,1:]

In [58]:
train = pd.concat([train,embarked_dummies],axis=1)
train.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Embarked__Q,Embarked__S
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S,0,1
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C,0,0
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S,0,1
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S,0,1
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S,0,1

In [64]:
#Method3: where we pass onto the whole data frame
pd.get_dummies(train,columns = ['Sex','Embarked'],drop_first = True)

,PassengerId,Survived,Pclass,Name,Age,SibSp,Parch,Ticket,Fare,Cabin,Sex_male,Embarked_Q,Embarked_S
0,1,0,3,"Braund, Mr. Owen Harris",22.0,1,0,A/5 21171,7.2500,NaN,1,0,1
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",38.0,1,0,PC 17599,71.2833,C85,0,0,0
2,3,1,3,"Heikkinen, Miss. Laina",26.0,0,0,STON/O2. 3101282,7.9250,NaN,0,0,1
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",35.0,1,0,113803,53.1000,C123,0,0,1
4,5,0,3,"Allen, Mr. William Henry",35.0,0,0,373450,8.0500,NaN,1,0,1
...,...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",27.0,0,0,211536,13.0000,NaN,1,0,1
887,888,1,1,"Graham, Miss. Margaret Edith",19.0,0,0,112053,30.0000,B42,0,0,1
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",NaN,1,2,W./C. 6607,23.4500,NaN,0,0,1
889,890,1,1,"Behr, Mr. Karl Howell",26.0,0,0,111369,30.0000,C148,1,0,0
890,891,0,3,"Dooley, Mr. Patrick",32.0,0,0,370376,7.7500,NaN,1,1,0

## How do I work with dates and times in pandas?